kimio-kosaka/Arduino_AVR-Microcontrollers/AVR-Microcontrollers/avr/boards.txt
#attiny-1.menu.cpu.attiny2313=ATtiny2313
attiny-1.upload.maximum_size=2048
attiny-1.upload.maximum_data_size=128
attiny-1.build.core=attiny2313
attiny-1.build.mcu=attiny2313
attiny-1.build.variant=tiny2313


attiny-1.menu.clock.internal-1=1MHz(Internal)
attiny-1.menu.clock.internal-1.bootloader.low_fuses=0x64
attiny-1.menu.clock.internal-1.bootloader.high_fuses=0xdf
attiny-1.menu.clock.internal-1.bootloader.extended_fuses=0xff
attiny-1.menu.clock.internal-1.build.f_cpu=1000000L

attiny-1.menu.clock.internal-8=8MHz(Internal)
attiny-1.menu.clock.internal-8.bootloader.low_fuses=0xe4
attiny-1.menu.clock.internal-8.bootloader.high_fuses=0xdf
attiny-1.menu.clock.internal-8.bootloader.extended_fuses=0xff
attiny-1.menu.clock.internal-8.build.f_cpu=8000000L

attiny-1.menu.clock.internal-dash=------------------
attiny-1.menu.clock.internal-dash.bootloader.low_fuses=0x64
attiny-1.menu.clock.internal-dash.bootloader.high_fuses=0xdf
attiny-1.menu.clock.internal-dash.bootloader.extended_fuses=0xff
attiny-1.menu.clock.internal-dash.build.f_cpu=1000000L

attiny-1.menu.clock.external-8=External(8MHz)
attiny-1.menu.clock.external-8.bootloader.low_fuses=0xff
attiny-1.menu.clock.external-8.bootloader.high_fuses=0xdf
attiny-1.menu.clock.external-8.bootloader.extended_fuses=0xff
attiny-1.menu.clock.external-8.build.f_cpu=8000000L

attiny-1.menu.clock.external-16=External(16MHz)
attiny-1.menu.clock.external-16.bootloader.low_fuses=0xff
attiny-1.menu.clock.external-16.bootloader.high_fuses=0xdf
attiny-1.menu.clock.external-16.bootloader.extended_fuses=0xff
attiny-1.menu.clock.external-16.build.f_cpu=16000000L

attiny-1.menu.clock.external-20=External(20MHz)
attiny-1.menu.clock.external-20.bootloader.low_fuses=0xff
attiny-1.menu.clock.external-20.bootloader.high_fuses=0xdf
attiny-1.menu.clock.external-20.bootloader.extended_fuses=0xff
attiny-1.menu.clock.external-20.build.f_cpu=20000000L

#
#    @kimio_kosaka  http://make.kosakalab.com
#
##################################################################

atmega-1.name=ATmega88/168

atmega-1.upload.tool=arduino:avrdude
#atmega-1.upload.protocol=arduino
#atmega-1.upload.speed=115200

atmega-1.bootloader.tool=arduino:avrdude
atmega-1.bootloader.file=dummy.hex
atmega-1.bootloader.unlock_bits=0xfF
atmega-1.bootloader.lock_bits=0xfF

atmega-1.build.core=arduino:arduino
atmega-1.build.board=AVR_atmega

#         ATmega88P
##----------------------------------------------------------------
atmega-1.menu.cpu.atmega88=ATmega88P
atmega-1.menu.cpu.atmega88.upload.maximum_size=8192
atmega-1.menu.cpu.atmega88.upload.maximum_data_size=1024
atmega-1.menu.cpu.atmega88.build.mcu=atmega88p

#         ATmega168P 
##----------------------------------------------------------------
atmega-1.menu.cpu.atmega168=ATmega168P
atmega-1.menu.cpu.atmega168.upload.maximum_size=16384
atmega-1.menu.cpu.atmega168.upload.maximum_data_size=1024
atmega-1.menu.cpu.atmega168.build.mcu=atmega168p

#         1MHz
##----------------------------------------------------------------
atmega-1.menu.clock.internal-1=1MHz(Internal)
atmega-1.menu.clock.internal-1.bootloader.low_fuses=0x62
atmega-1.menu.clock.internal-1.bootloader.high_fuses=0xdd
atmega-1.menu.clock.internal-1.bootloader.extended_fuses=0xff
atmega-1.menu.clock.internal-1.build.f_cpu=1000000L
atmega-1.menu.clock.internal-1.build.variant=atmega_int

#         8MHz
##----------------------------------------------------------------
atmega-1.menu.clock.internal-8=8MHz(Internal)
atmega-1.menu.clock.internal-8.bootloader.low_fuses=0xe2
atmega-1.menu.clock.internal-8.bootloader.high_fuses=0xdd
atmega-1.menu.clock.internal-8.bootloader.extended_fuses=0xff
atmega-1.menu.clock.internal-8.build.f_cpu=8000000L
atmega-1.menu.clock.internal-8.build.variant=atmega_int

atmega-1.menu.clock.internal-dash=----------------
atmega-1.menu.clock.internal-dash.bootloader.low_fuses=0x62
atmega-1.menu.clock.internal-dash.bootloader.high_fuses=0xdf
atmega-1.menu.clock.internal-dash.bootloader.extended_fuses=0xf9
atmega-1.menu.clock.internal-dash.build.f_cpu=1000000L
atmega-1.menu.clock.internal-dash.build.variant=atmega_int

#        16MHz
##----------------------------------------------------------------
atmega-1.menu.clock.external-16=External(16MHz)
atmega-1.menu.clock.external-16.bootloader.low_fuses=0xff
atmega-1.menu.clock.external-16.bootloader.high_fuses=0xdd
atmega-1.menu.clock.external-16.bootloader.extended_fuses=0xff
atmega-1.menu.clock.external-16.build.f_cpu=16000000L
atmega-1.menu.clock.external-16.build.variant=standard

#        20MHz
##----------------------------------------------------------------
atmega-1.menu.clock.external-20=External(20MHz)
atmega-1.menu.clock.external-20.bootloader.low_fuses=0xff
atmega-1.menu.clock.external-20.bootloader.high_fuses=0xdd
atmega-1.menu.clock.external-20.bootloader.extended_fuses=0xff
atmega-1.menu.clock.external-20.build.f_cpu=20000000L
atmega-1.menu.clock.external-20.build.variant=standard



#         ATmega328P 
##----------------------------------------------------------------

atmega-2.name=ATmega328

atmega-2.upload.tool=arduino:avrdude
#atmega-2.upload.protocol=arduino
#atmega-2.upload.speed=115200

atmega-2.bootloader.tool=arduino:avrdude
atmega-2.bootloader.file=dummy.hex
atmega-2.bootloader.unlock_bits=0xFF
atmega-2.bootloader.lock_bits=0xFF

atmega-2.build.core=arduino:arduino
atmega-2.build.board=AVR_atmega

atmega-2.upload.maximum_size=32768
atmega-2.upload.maximum_data_size=2048
atmega-2.build.mcu=atmega328p

#         1MHz
##----------------------------------------------------------------
atmega-2.menu.clock.internal-1=1MHz(Internal)
atmega-2.menu.clock.internal-1.bootloader.low_fuses=0x62
atmega-2.menu.clock.internal-1.bootloader.high_fuses=0xde
atmega-2.menu.clock.internal-1.bootloader.extended_fuses=0xfd
atmega-2.menu.clock.internal-1.build.f_cpu=1000000L
atmega-2.menu.clock.internal-1.build.variant=atmega_int

#         8MHz
##----------------------------------------------------------------
atmega-2.menu.clock.internal-8=8MHz(Internal)
atmega-2.menu.clock.internal-8.bootloader.low_fuses=0xe2
atmega-2.menu.clock.internal-8.bootloader.high_fuses=0xde
atmega-2.menu.clock.internal-8.bootloader.extended_fuses=0xfd
atmega-2.menu.clock.internal-8.build.f_cpu=8000000L
atmega-2.menu.clock.internal-8.build.variant=atmega_int

