kimio-kosaka/Arduino_AVR-Microcontrollers/AVR-Microcontrollers/avr/boards.txt
atmega-2.menu.clock.internal-dash=-----------------
atmega-2.menu.clock.internal-dash.bootloader.low_fuses=0x62
atmega-2.menu.clock.internal-dash.bootloader.high_fuses=0xd9
atmega-2.menu.clock.internal-dash.bootloader.extended_fuses=0xff
atmega-2.menu.clock.internal-dash.build.f_cpu=1000000L
atmega-2.menu.clock.internal-dash.build.variant=atmega_int

#        16MHz
##----------------------------------------------------------------
atmega-2.menu.clock.external-16=External(16MHz)
atmega-2.menu.clock.external-16.bootloader.low_fuses=0xff
atmega-2.menu.clock.external-16.bootloader.high_fuses=0xde
atmega-2.menu.clock.external-16.bootloader.extended_fuses=0xfd
atmega-2.menu.clock.external-16.build.f_cpu=16000000L
atmega-2.menu.clock.external-16.build.variant=standard

#        20MHz
##----------------------------------------------------------------
atmega-2.menu.clock.external-20=External(20MHz)
atmega-2.menu.clock.external-20.bootloader.low_fuses=0xff
atmega-2.menu.clock.external-20.bootloader.high_fuses=0xde
atmega-2.menu.clock.external-20.bootloader.extended_fuses=0xfd
atmega-2.menu.clock.external-20.build.f_cpu=20000000L
atmega-2.menu.clock.external-20.build.variant=standard


#
#        Lauszus/Sanguino https://github.com/Lauszus/Sanguino
#        modified by @kimio_kosaka
#
##################################################################

atmega-3.name=ATmega644/1284

atmega-3.upload.tool=arduino:avrdude
#atmega-3.upload.protocol=arduino
#atmega-3.upload.speed=115200
atmega-3.bootloader.unlock_bits=0xff
atmega-3.bootloader.lock_bits=0xff
atmega-3.bootloader.tool=arduino:avrdude
atmega-3.bootloader.file=dummy.hex
atmega-3.build.core=arduino:arduino
atmega-3.build.board=AVR_atmega
atmega-3.build.variant=sanguino



##         ATmega644P 
##----------------------------------------------------------------
atmega-3.menu.cpu.atmega644-8=ATmega644P
atmega-3.menu.cpu.atmega644-8.upload.maximum_size=65536
atmega-3.menu.cpu.atmega644-8.upload.maximum_data_size=4096
atmega-3.menu.cpu.atmega644-8.build.mcu=atmega644p

##         ATmega1284P 
##----------------------------------------------------------------
atmega-3.menu.cpu.atmega1284-8=ATmega1284P

atmega-3.menu.cpu.atmega1284-8.upload.maximum_size=131072
atmega-3.menu.cpu.atmega1284-8.upload.maximum_data_size=16384
atmega-3.menu.cpu.atmega1284-8.build.mcu=atmega1284p

##        internal 1MHz
##----------------------------------------------------------------
atmega-3.menu.clock.internal-1=1MHz(Internal)
atmega-3.menu.clock.internal-1.bootloader.low_fuses=0x62
atmega-3.menu.clock.internal-1.bootloader.high_fuses=0xde
atmega-3.menu.clock.internal-1.bootloader.extended_fuses=0xfd
atmega-3.menu.clock.internal-1.build.f_cpu=1000000L

##        internal 8MHz
##----------------------------------------------------------------
atmega-3.menu.clock.internal-8=8MHz(Internal)
atmega-3.menu.clock.internal-8.bootloader.low_fuses=0xe2
atmega-3.menu.clock.internal-8.bootloader.high_fuses=0xde
atmega-3.menu.clock.internal-8.bootloader.extended_fuses=0xfd
atmega-3.menu.clock.internal-8.build.f_cpu=8000000L

atmega-3.menu.clock.internal-dash=---------------
atmega-3.menu.clock.internal-dash.bootloader.low_fuses=0x62
atmega-3.menu.clock.internal-dash.bootloader.high_fuses=0x99
atmega-3.menu.clock.internal-dash.bootloader.extended_fuses=0xff
atmega-3.menu.clock.internal-dash.build.f_cpu=1000000L

##        external 16MHz
##----------------------------------------------------------------
atmega-3.menu.clock.external-16=External(16MHz)
atmega-3.menu.clock.external-16.bootloader.low_fuses=0xff
atmega-3.menu.clock.external-16.bootloader.high_fuses=0xde
atmega-3.menu.clock.external-16.bootloader.extended_fuses=0xfd
atmega-3.menu.clock.external-16.build.f_cpu=16000000L

#        external 20MHz
##----------------------------------------------------------------
atmega-3.menu.clock.external-20=External(20MHz)
atmega-3.menu.clock.external-20.bootloader.low_fuses=0xff
atmega-3.menu.clock.external-20.bootloader.high_fuses=0xde
atmega-3.menu.clock.external-20.bootloader.extended_fuses=0xfd
atmega-3.menu.clock.external-20.build.f_cpu=20000000L


#
#    @kimio_kosaka  http://make.kosakalab.com
#
##################################################################

atmega-64.name=ATmega64

atmega-64.upload.tool=arduino:avrdude
#atmega-64.upload.protocol=arduino
#atmega-64.upload.speed=115200

atmega-64.bootloader.tool=arduino:avrdude
atmega-64.bootloader.unlock_bits=0xff
atmega-64.bootloader.lock_bits=0xff
atmega-64.bootloader.file=dummy.hex

atmega-64.build.core=arduino:arduino
atmega-64.build.board=AVR_atmega64

#atmega-64.menu.cpu.atmega64=ATmega64
atmega-64.upload.maximum_size=65536
atmega-64.upload.maximum_data_size=4096
atmega-64.build.mcu=atmega64
atmega-64.core=atmega64
atmega-64.variant=atmega64

atmega-64.menu.clock.internal-8=8MHz(Internal)
atmega-64.menu.clock.internal-8.bootloader.low_fuses=0xd4
atmega-64.menu.clock.internal-8.bootloader.high_fuses=0xdf
atmega-64.menu.clock.internal-8.bootloader.extended_fuses=0xff
atmega-64.menu.clock.internal-8.build.f_cpu=8000000L

atmega-64.menu.clock.internal-dash=---------------
atmega-64.menu.clock.internal-dash.bootloader.low_fuses=0xd4
atmega-64.menu.clock.internal-dash.bootloader.high_fuses=0xdf
atmega-64.menu.clock.internal-dash.bootloader.extended_fuses=0xff
atmega-64.menu.clock.internal-dash.build.f_cpu=8000000L

